{
  "profile": {
    "about": {
      "nationality": "French",
      "location": "Paris",
      "background": "Hi! My name is Raphael, I'm 21 years old and I'm a Data Analyst apprentice at L'AGEFI. Beyond lines of code and dashboards, I'm someone who has traveled the world to find my path."
    }
  },
  
  "mon_histoire": {    
    "chapters": [
      {
        "title": "The Early Years: Hong Kong",
        "content": "My story begins far from Paris. I grew up in Hong Kong, a city where East meets West, where skyscrapers stand alongside traditional temples. This international childhood taught me early on to navigate between cultures, to adapt, to stay curious. Perhaps that's where my taste for solving complex problems took root: when you grow up between several worlds, you learn to connect the dots differently."
      },
      {
        "title": "The Dutch Adventure: Discovering AI",
        "content": "After high school, I headed to the Netherlands at the University of Groningen to study computer science and artificial intelligence. The courses on machine learning, algorithms, how data tells stories... I was fascinated. But the very academic approach didn't allow me enough hands-on experience, to create concrete things. I wanted to see the direct impact of my work."
      },
      {
        "title": "Paris and ECE: The Turning Point",
        "content": "I joined ECE Paris for a more applied program. Team projects, real cases, the opportunity to develop applications that truly serve a purpose. I understood that it wasn't just coding that interested me, but solving concrete problems with technology. Creating tools that people actually use."
      },
      {
        "title": "L'AGEFI: Tech in Service of Information",
        "content": "My apprenticeship at L'AGEFI has been an excellent school. A leading financial media outlet, expert journalists, and me having to understand their needs and create tools to automate their processes. I learned to speak business, to understand that a good technical tool is worthless if it doesn't address a real need. I automate newsletters, create analytics dashboards, develop document analysis systems. Every day, I see the impact of my work."
      },
      {
        "title": "Today",
        "content": "I'm applying for Master's programs in Data Engineering while working on exciting projects: ML trading simulators, public health data analysis, automation systems. I know where I want to go: become a Data Engineer, then Senior, and why not one day Head of Data. But the journey is as important as the destination."
      }
    ]
  },
  
  "experiences_cles": [
    {
      "title": "Data & AI Developer Apprentice - L'AGEFI",
      "period": "2023 - Present",
      "description": "Within the digital team of a leading financial media outlet",
      "achievements": [
        "Automation of editorial processes with n8n and APIs, reducing daily newsletter preparation time by 70%",
        "Development of Piano Analytics dashboards connected to BigQuery, used daily by 15+ journalists",
        "Implementation of a RAG solution for intelligent querying of financial documents, accelerating information research by 50%",
        "Construction of ETL pipelines in Python for automated analysis of financial articles"
      ]
    },
    {
      "title": "Developer - ECE Junior Enterprise",
      "period": "2022 - 2023",
      "description": "Client projects within the Junior Enterprise",
      "achievements": [
        "Development of a Python ETL pipeline automating client data consolidation and eliminating 100% of data entry errors",
        "Creation of a media monitoring application with n8n for automatic aggregation of information sources"
      ]
    },
    {
      "title": "Academic & Personal Projects",
      "period": "2021 - Present",
      "description": "Development of innovative data and web applications",
      "achievements": [
        "Data visualization web application (R/Shiny) for public health data analysis",
        "ML trading simulator combining machine learning and sentiment analysis on French financial news",
        "Cancer research investment analysis comparing global investments and mortality rates (WHO, PubMed, clinical trials data)",
        "Various projects: games, web applications, programming challenges in Python, Java, C/C++"
      ]
    }
  ],
  
  "adn": {
    "competences": [
      {
        "name": "Technical Expertise",
        "description": "Proficiency in programming languages (Python, SQL, Java, C/C++, JavaScript, R, PHP) and cloud platforms (AWS, Google Cloud). Experience with orchestration tools like n8n to design reliable and scalable solutions."
      },
      {
        "name": "Business Acumen",
        "description": "Ability to understand business challenges to prioritize developments. Sensitivity to UX and user testing to ensure adoption of created tools."
      },
      {
        "name": "Teaching & Collaboration",
        "description": "Ability to train teams on new tools and work synergistically with data scientists and business analysts."
      }
    ]
  },
  
  "approche_valeurs": {
    "working_style": "Analytical and structured, I combine technical rigor with curiosity and ingenuity. I enjoy teamwork and collective challenges in a collaborative and supportive environment.",
    "values": "Sociable and communicative, ethics is an essential value in my work as in my personal life."
  },
  
  "aspirations": {
    "immediate": "Become a Data Engineer within an innovative company that drives progress.",
    "five_years": "Evolve into a Senior Data Engineer role to design technical architectures and mentor juniors.",
    "ten_years": "Have strategic impact as a Principal Data Engineer or Head of Data to drive an organization's data strategy."
  },
  
  "personal": {
    "hobbies": [
      "Guitar",
      "Rock climbing",
      "Cycling",
      "Pétanque",
      "Parisian cafés with friends"
    ],
    "inspiration": [
      "Creativity through music",
      "Social connections",
      "Humanitarian aid with ONG MAYAA (Nepal-focused organization)"
    ]
  }
}